In [1]:
import pandas as pd
df = pd.DataFrame({'var1' : [4,3,8],
                  'var2' : [2,6,1]})
df

   var1  var2
0     4     2
1     3     6
2     8     1

In [2]:
df['var_sum'] = df['var1']+df['var2']
df

   var1  var2  var_sum
0     4     2        6
1     3     6        9
2     8     1        9

In [3]:
df['mean'] = df['var_sum']/2
df

   var1  var2  var_sum  mean
0     4     2        6   3.0
1     3     6        9   4.5
2     8     1        9   4.5